[
    {
        "id": "sun",
        "name": "The Sun",
        "type": "Yellow Dwarf (G2V)",
        "constellation": "N/A",
        "distance": "0.0000158 light-years (1 AU)",
        "mass": "1 Solar mass",
        "radius": "696,340 km",
        "description": "The star at the center of our Solar System. It is a nearly perfect sphere of hot plasma, heated to incandescence by nuclear fusion reactions in its core. It radiates energy mainly as visible light and infrared radiation.",
        "funFacts": [
            "The Sun accounts for 99.86% of the mass of the Solar System.",
            "Light from the Sun takes 8 minutes and 20 seconds to reach Earth.",
            "The Sun travels at 220 km per second relative to the galactic center."
        ],
        "imageKeyword": "The Sun star"
    },
    {
        "id": "betelgeuse",
        "name": "Betelgeuse",
        "type": "Red Supergiant",
        "constellation": "Orion",
        "distance": "642.5 light-years",
        "mass": "16.5 Solar masses",
        "radius": "764 Solar radii",
        "description": "A red supergiant of spectral type M1-2, it is one of the largest stars visible to the naked eye. If placed at the center of our solar system, its surface would extend past the asteroid belt, possibly swallowing Jupiter.",
        "funFacts": [
            "It is destined to explode as a supernova within the next 100,000 years.",
            "It has dimmed significantly in recent times, causing excitement among astronomers.",
            "The name comes from Arabic 'Yad al-Jauza' meaning 'Hand of Orion'."
        ],
        "imageKeyword": "Betelgeuse star"
    },
    {
        "id": "sirius",
        "name": "Sirius (Dog Star)",
        "type": "Main Sequence (A1V)",
        "constellation": "Canis Major",
        "distance": "8.6 light-years",
        "mass": "2.063 Solar masses",
        "radius": "1.71 Solar radii",
        "description": "Sirius is the brightest star in the night sky. It is actually a binary star system, consisting of a main-sequence star, Sirius A, and a faint white dwarf companion, Sirius B.",
        "funFacts": [
            "Sirius is almost twice as bright as Canopus, the next brightest star.",
            "Ancient Egyptians based their calendar on the heliacal rising of Sirius.",
            "The 'Dog Days' of summer refer to the rising of the Dog Star with the Sun."
        ],
        "imageKeyword": "Sirius star"
    },
    {
        "id": "uy_scuti",
        "name": "UY Scuti",
        "type": "Red Hypergiant",
        "constellation": "Scutum",
        "distance": "9,500 light-years",
        "mass": "7-10 Solar masses",
        "radius": "1,708 Solar radii",
        "description": "UY Scuti is a red hypergiant and one of the largest known stars by radius. It is a pulsating variable star with a radius around 1,700 times that of the Sun. If placed in our solar system, its photosphere would extend beyond Jupiter's orbit.",
        "funFacts": [
            "If it were replaced by the Sun, it would take a beam of light 7 hours to circle it (versus 14.5 seconds for the Sun).",
            "Despite its size, it is not very dense, less than a millionth the density of Earth's atmosphere at sea level."
        ],
        "imageKeyword": "UY Scuti star"
    },
    {
        "id": "proxima_centauri",
        "name": "Proxima Centauri",
        "type": "Red Dwarf (M5.5Ve)",
        "constellation": "Centaurus",
        "distance": "4.2465 light-years",
        "mass": "0.122 Solar masses",
        "radius": "0.154 Solar radii",
        "description": "A small, low-mass star located 4.2465 light-years away from the Sun in the southern constellation of Centaurus. It is the nearest known star to the Sun.",
        "funFacts": [
            "It is too faint to be seen with the naked eye.",
            "It hosts at least two planets, including Proxima b in the habitable zone.",
            "It is a flare star, undergoing random increases in brightness."
        ],
        "imageKeyword": "Proxima Centauri"
    }
]